mbardwell/rstrap/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hts/Src/main.c
/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const *p_evt)
{
    ret_code_t err_code;
    bool is_indication_enabled;

    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
    case PM_EVT_CONN_SEC_SUCCEEDED:
        // Send a single temperature measurement if indication is enabled.
        // NOTE: For this to work, make sure ble_hts_on_ble_evt() is called before
        // pm_evt_handler() in ble_evt_dispatch().
        err_code = ble_hts_is_indication_enabled(&m_hts, &is_indication_enabled);
        APP_ERROR_CHECK(err_code);
        if (is_indication_enabled)
        {
            temperature_measurement_send();
        }
        break;

    case PM_EVT_PEERS_DELETE_SUCCEEDED:
        advertising_start(false);
        break;

    default:
        break;
    }
}

static void TensionLevelUpdate(void)
{
    ret_code_t err_code;
    uint32_t tension_level;
    // largest value to be sent is 2^23 = 8388608, which is 7 bytes. Add one for EOL character
    static uint32_t max_n_digits = 8;
    uint8_t tension[max_n_digits];
    uint16_t len;

    if (simEnabled)
    {
        tension_level = sensorsim_measure(&m_tension_sim_state, &m_tension_sim_cfg);
        len = uint32_encode(tension_level, tension);
        NRF_LOG_INFO("Sending tension measurement: %d", *tension);

        err_code = ble_nus_data_send(&m_nus, tension, &len, m_conn_handle);
        if (err_code != NRF_ERROR_INVALID_STATE) // TODO: remove this quick fix (used in other send functions too)
        {
            APP_ERROR_CHECK(err_code);
        }
    }
    else
    {
        if (Hx711SampleConvert(&tension_level) == NRFX_SUCCESS)
        {
            len = (uint16_t) max_n_digits;
            __itoa(tension_level, (char*) tension, 10);
            NRF_LOG_INFO("Sending tension measurement: %d of length: %d", tension_level, len);

            err_code = ble_nus_data_send(&m_nus, tension, &len, m_conn_handle);
            if (err_code != NRF_ERROR_INVALID_STATE) // TODO: remove this quick fix (used in other send functions too)
            {
                APP_ERROR_CHECK(err_code);
            }
        }
    }
}

/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
    ret_code_t err_code;
    nrf_saadc_value_t battery_level;

    if (simEnabled)
    {
        battery_level = (nrf_saadc_value_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);
    }
    else
    {
        /* nrfx_saadc_sample_convert will put a value between 0-1023 in battery_level */
        err_code = nrfx_saadc_sample_convert(NRF_SAADC_INPUT_VDD, &battery_level);
        APP_ERROR_CHECK(err_code);

        /* AdcResultInMillivolts will return a value between 0-3600*/
        battery_level = AdcResultInMillivolts(battery_level, ADC_REF_VOLTAGE_IN_MILLIVOLTS, ADC_RES_10BIT, ADC_PRE_SCALING_COMPENSATION) + DIODE_FWD_VOLT_DROP_MILLIVOLTS;
        battery_level = MillivoltsToPercentCharge(battery_level, LOWEST_ALLOWABLE_BATTERY_VOLTAGE, NOMINAL_FRESH_BATTERY_VOLTAGE);
    }

    NRF_LOG_INFO("Sending battery measurement: %d", battery_level);

    err_code = ble_bas_battery_level_update(&m_bas, (uint8_t)battery_level, m_conn_handle);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
    {
        APP_ERROR_HANDLER(err_code);
    }
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}

static void tension_timer_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    TensionLevelUpdate();
}

static void hts_timer_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    temperature_measurement_send();
}

/**@brief Function for populating simulated health thermometer measurement.
 */
static void hts_sim_measurement(ble_hts_meas_t *p_meas)
{
    static ble_date_time_t time_stamp = {2012, 12, 5, 11, 50, 0};

    uint32_t celciusX100;

    p_meas->temp_in_fahr_units = false;
    p_meas->time_stamp_present = true;
    p_meas->temp_type_present = (TEMP_TYPE_AS_CHARACTERISTIC ? false : true);

    celciusX100 = sensorsim_measure(&m_temp_celcius_sim_state, &m_temp_celcius_sim_cfg);

    p_meas->temp_in_celcius.exponent = -2;
    p_meas->temp_in_celcius.mantissa = celciusX100;
    p_meas->temp_in_fahr.exponent = -2;
    p_meas->temp_in_fahr.mantissa = (32 * 100) + ((celciusX100 * 9) / 5);
    p_meas->time_stamp = time_stamp;
    p_meas->temp_type = BLE_HTS_TEMP_TYPE_FINGER;

    // update simulated time stamp
    time_stamp.seconds += 27;
    if (time_stamp.seconds > 59)
    {
        time_stamp.seconds -= 60;
        time_stamp.minutes++;
        if (time_stamp.minutes > 59)
        {
            time_stamp.minutes = 0;
        }
    }
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_tension_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                tension_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_hts_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                hts_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

